#+TITLE: Notes of IDL Programming
#+AUTHOR: Faxiang Zheng
#+OPTIONS: H:3 toc:nil ^:nil
#+HTML_HEAD: <style>table.center {margin-left:auto; margin-right:auto;}</style>
#+LATEX_CLASS: article
#+LATEX_CLASS_OPTIONS: [12pt, titlepage]
#+LATEX_HEADER: \newcommand{\tabincell}[2]{\begin{tabular}{@{}#1@{}}#2\end{tabular}}
#+LATEX_HEADER: \usepackage{mathspec}
#+LATEX_HEADER: \setmainfont{Georgia}
#+LATEX_HEADER: \setmonofont[Scale=0.95]{Monaco}
#+LATEX_HEADER: \usepackage{geometry}
#+LATEX_HEADER: \geometry{ a4paper, total={160mm,247mm}, left=25mm, top=25mm, }
#+LATEX_HEADER: \pagestyle{headings}

*** vector/array slicing

#+BEGIN_SRC idl
  vector1 = IndGen(4)
  vector2 = vector1[0:2]
  print, vector2
#+END_SRC

different from python

#+BEGIN_SRC python :results output
  import numpy as np
  vector1 = np.arange(4)
  vector2 = vector1[0:2]
  print("vector2 = ", vector2)
#+END_SRC

#+RESULTS:
: vector2 =  [0 1]

array slicing is just the same
you can easily get a row of the array or a subarray through it's indices

